<blank>
<s>
</s>
(
)
.
;
}
{
VAR_1
,
VAR_2
TYPE_1
=
METHOD_1
VAR_3
return
METHOD_2
TYPE_2
public
if
VAR_4
>
String
METHOD_3
new
<
TYPE_3
null
void
this
VAR_5
STRING_1
METHOD_4
TYPE_4
+
==
:
final
VAR_6
!=
private
METHOD_5
boolean
int
e
throws
STRING_2
0
TYPE_5
static
true
false
]
[
!
&&
List
VAR_7
try
else
?
for
get
catch
METHOD_6
throw
Object
name
-
protected
value
result
equals
i
1
IOException
TYPE_6
STRING_3
super
Exception
class
VAR_8
add
context
||
long
toString
instanceof
METHOD_7
size
T
key
id
Map
length
ANNOTATION_1
log
ArrayList
TYPE_7
type
File
INT_1
STRING_4
getName
VAR_9
put
close
System
case
Integer
assertEquals
isEmpty
o
path
""
builder
synchronized
@Override
info
logger
request
METHOD_8
append
getId
++
Set
file
error
format
config
message
out
build
event
map
byte
Class
input
stream
index
response
contains
values
node
TYPE_8
obj
element
Guid
getInstance
Long
Collection
session
LOG
getClass
entry
getValue
VAR_10
IllegalArgumentException
data
ex
Assert
t
Optional
buffer
*
debug
STRING_5
Boolean
start
create
parent
Throwable
RuntimeException
println
run
filter
finally
command
assertTrue
2
of
remove
state
getMessage
iterator
Collections
while
ctx
extends
p
assertThat
uri
url
object
query
s
properties
list
next
HashMap
client
Arrays
execute
getParameters
Context
break
trace
entity
options
parameters
is
set
METHOD_9
InterruptedException
status
double
c
clear
in
user
params
b
Type
listener
R
target
count
StringUtils
model
+=
addAll
warn
IllegalStateException
vm
item
CHAR_1
STRING_6
args
source
StringBuilder
Thread
valueOf
cache
channel
view
when
Builder
msg
>=
project
TYPE_9
configuration
text
VAR_11
|
resource
position
default
x
offset
apply
val
getType
switch
description
getKey
r
containsKey
getProperty
assertNotNull
...
asList
task
output
instance
that
HashSet
method
connection
f
substring
hasNext
INT_2
action
db
n
View
v
exception
getString
Path
Response
TimeUnit
conf
location
field
forEach
split
Date
collect
update
ImmutableList
<=
version
m
group
/
child
server
a
page
exists
write
res
METHOD_10
from
content
STRING_7
getPath
factory
LOGGER
startsWith
call
host
VAR_12
Entry
req
writer
column
Iterator
results
Math
token
getStatus
line
monitor
read
ByteBuffer
Collectors
d
Double
table
Constants
assert
org
time
metadata
container
Log
3
parse
sb
SWT
reader
string
equalsIgnoreCase
FLOAT_1
commit
cmd
keySet
entrySet
Status
TYPE_10
STRING_8
cluster
repo
to
buf
j
props
record
ANNOTATION_2
&
4
vds
empty
trim
currentTimeMillis
TAG
parser
matcher
y
row
VAR_13
10
max
METHOD_11
float
short
CHAR_2
Logger
Messages
err
100
sess
5
NONE
setText
bind
it
job
%
Utils
STRING_9
TYPE_11
Level
INT_3
char
--
parseInt
Pair
VAR_14
isPresent
STRING_10
continue
VAR_15
getInt
TYPE_12
binder
outputStream
STRING_11
|=
METHOD_12
STRING_12
INT_4
STRING_13
VAR_16
abstract
FLOAT_2
^
STRING_14
METHOD_13
do
VAR_17
&=
STRING_15
VAR_18
-=
TYPE_13
~
and
OS
FLOAT_3
INT_5
METHOD_14
CHAR_3
STRING_16
VAR_19
STRING_17
METHOD_15
VAR_20
VAR_21
STRING_18
ANNOTATION_3
VAR_22
VAR_23
/=
STRING_19
INT_6
CHAR_4
CHAR_5
CHAR_6
CHAR_7
CHAR_8
CHAR_9
CHAR_10
FLOAT_4
METHOD_16
INT_7
VAR_24
CHAR_11
CHAR_12
CHAR_13
>>>=
FLOAT_5
clientMessage
STRING_20
TYPE_14
<<=
VAR_25
FLOAT_6
*=
TYPE_15
TYPE_16
TYPE_17
TYPE_18
native
^=
INT_8
INT_9
INT_10
CHAR_14
CHAR_15
CHAR_16
