<blank>
<s>
</s>
(
)
.
;
}
{
VAR_1
,
VAR_2
TYPE_1
=
METHOD_1
VAR_3
return
METHOD_2
public
TYPE_2
VAR_4
>
if
String
<
METHOD_3
new
null
TYPE_3
void
this
VAR_5
METHOD_4
STRING_1
TYPE_4
private
:
==
final
+
!=
boolean
VAR_6
int
throws
METHOD_5
static
e
0
TYPE_5
STRING_2
[
]
List
false
true
!
&&
?
VAR_7
for
try
get
protected
METHOD_6
Object
name
else
-
value
throw
catch
result
IOException
i
1
equals
super
TYPE_6
Exception
STRING_3
add
class
context
VAR_8
long
||
T
toString
key
size
METHOD_7
Map
instanceof
id
length
ANNOTATION_1
isEmpty
File
type
log
ArrayList
TYPE_7
assertEquals
getName
put
case
STRING_4
o
VAR_9
path
builder
INT_1
synchronized
Integer
close
getId
append
request
file
Set
++
logger
message
""
format
METHOD_8
input
event
byte
config
info
Class
obj
build
response
@Override
node
values
Collection
index
Guid
map
error
contains
stream
element
getValue
session
Long
data
TYPE_8
IllegalArgumentException
Optional
entry
parent
getInstance
create
of
start
finally
getClass
VAR_10
state
buffer
*
remove
url
2
command
Throwable
extends
run
STRING_5
assertThat
debug
t
Boolean
System
list
p
filter
Arrays
uri
RuntimeException
properties
ex
ctx
object
while
LOG
s
StringBuilder
Assert
next
assertTrue
query
execute
trace
client
getMessage
iterator
b
break
getParameters
c
Context
double
count
set
HashMap
is
entity
out
status
clear
InterruptedException
Collections
options
user
Type
METHOD_9
parameters
args
target
StringUtils
item
in
source
Builder
listener
R
addAll
view
msg
cache
vm
text
params
project
default
offset
>=
channel
model
valueOf
configuration
val
IllegalStateException
assertNotNull
asList
|
switch
x
CHAR_1
resource
position
apply
+=
when
getType
...
STRING_6
warn
TYPE_9
VAR_11
output
method
description
n
getKey
task
r
f
forEach
HashSet
that
connection
ImmutableList
location
Response
action
instance
substring
getProperty
field
Path
Thread
containsKey
<=
child
db
write
group
split
View
conf
exception
update
v
INT_2
/
hasNext
TimeUnit
factory
exists
getString
from
m
res
Date
a
server
results
content
3
getPath
req
read
host
version
page
call
column
METHOD_10
STRING_7
collect
token
ByteBuffer
table
getStatus
metadata
startsWith
VAR_12
line
sb
equalsIgnoreCase
Math
monitor
parse
time
assert
Iterator
Double
Entry
writer
d
string
empty
reader
Constants
LOGGER
repo
container
cluster
Collectors
ANNOTATION_2
buf
vds
cmd
commit
Log
record
10
println
SWT
FLOAT_1
&
Status
max
to
STRING_8
j
TYPE_10
4
keySet
y
matcher
row
currentTimeMillis
trim
TAG
entrySet
props
VAR_13
sess
org
100
float
short
METHOD_11
parser
Logger
NONE
CHAR_2
%
isPresent
Messages
job
it
bind
Utils
setText
--
parseInt
STRING_9
char
5
Level
TYPE_11
INT_3
VAR_14
Pair
STRING_10
err
continue
~
outputStream
binder
getInt
VAR_15
TYPE_12
|=
STRING_11
METHOD_12
STRING_12
abstract
do
INT_4
^
FLOAT_2
STRING_13
VAR_16
METHOD_13
STRING_14
&=
VAR_17
VAR_18
and
OS
TYPE_13
STRING_15
INT_5
METHOD_14
CHAR_3
-=
STRING_16
VAR_19
VAR_20
VAR_21
VAR_23
STRING_17
FLOAT_3
ANNOTATION_3
VAR_22
/=
METHOD_15
STRING_18
CHAR_4
CHAR_5
CHAR_6
CHAR_7
CHAR_8
CHAR_9
CHAR_10
>>>=
FLOAT_4
FLOAT_5
clientMessage
STRING_19
TYPE_14
*=
METHOD_16
<<=
INT_7
CHAR_11
CHAR_12
CHAR_13
INT_6
STRING_20
^=
TYPE_15
TYPE_16
TYPE_17
native
VAR_24
